In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'city': ['北京', '北京', '北京', '上海', '上海', '上海'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'population': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
dataframe = pd.DataFrame(data)

In [4]:
dataframe

  city  year  population
0   北京  2000         1.5
1   北京  2001         1.7
2   北京  2002         3.6
3   上海  2001         2.4
4   上海  2002         2.9
5   上海  2003         3.2

In [5]:
type(dataframe)

pandas.core.frame.DataFrame

In [6]:
dataframe['city'] # 取的Series

0    北京
1    北京
2    北京
3    上海
4    上海
5    上海
Name: city, dtype: object

In [7]:
type(dataframe['city'])

pandas.core.series.Series

In [8]:
dataframe[['city']] # 取的DataFrame

  city
0   北京
1   北京
2   北京
3   上海
4   上海
5   上海

In [10]:
type(dataframe[['city']])

pandas.core.frame.DataFrame

In [9]:
dataframe[['city','year']]

  city  year
0   北京  2000
1   北京  2001
2   北京  2002
3   上海  2001
4   上海  2002
5   上海  2003

In [11]:
dataframe['city']

0    北京
1    北京
2    北京
3    上海
4    上海
5    上海
Name: city, dtype: object

In [12]:
dataframe['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [25]:
a = pd.DataFrame([dataframe['city'],dataframe['year']])

In [26]:
a

         0     1     2     3     4     5
city    北京    北京    北京    上海    上海    上海
year  2000  2001  2002  2001  2002  2003

In [29]:
f2 = pd.DataFrame(data,columns=['year','city','debt'])

In [30]:
f2

   year city debt
0  2000   北京  NaN
1  2001   北京  NaN
2  2002   北京  NaN
3  2001   上海  NaN
4  2002   上海  NaN
5  2003   上海  NaN

In [31]:
f2.index

RangeIndex(start=0, stop=6, step=1)

In [32]:
f2.values

array([[2000, '北京', nan],
       [2001, '北京', nan],
       [2002, '北京', nan],
       [2001, '上海', nan],
       [2002, '上海', nan],
       [2003, '上海', nan]], dtype=object)

In [34]:
f3 = pd.DataFrame(data,columns=['city','year','population','a'])
f3

  city  year  population    a
0   北京  2000         1.5  NaN
1   北京  2001         1.7  NaN
2   北京  2002         3.6  NaN
3   上海  2001         2.4  NaN
4   上海  2002         2.9  NaN
5   上海  2003         3.2  NaN

In [39]:
# 列方向(columns)可以越界,行方向(index)不可以越界
f4 = pd.DataFrame(data,columns=['city','year','population','a','b'],index = ['one','two','three','foru','five','six'])
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

# 利用嵌套字典创建带索引及列名,外层字典的key是列名,内层字典的key是行索引

In [40]:
pop = {'北京':{2001:2.4,2002:2.9},
       '南京':{2000:1.5,2001:1.7,2002:1.9}}
f5 = pd.DataFrame(pop)
f5

       北京   南京
2001  2.4  1.7
2002  2.9  1.9
2000  NaN  1.5

In [42]:
print(f5) # 不要用print输出DataFrame

       北京   南京
2001  2.4  1.7
2002  2.9  1.9
2000  NaN  1.5

In [43]:
f2

   year city debt
0  2000   北京  NaN
1  2001   北京  NaN
2  2002   北京  NaN
3  2001   上海  NaN
4  2002   上海  NaN
5  2003   上海  NaN

In [44]:
f3

  city  year  population    a
0   北京  2000         1.5  NaN
1   北京  2001         1.7  NaN
2   北京  2002         3.6  NaN
3   上海  2001         2.4  NaN
4   上海  2002         2.9  NaN
5   上海  2003         3.2  NaN

In [45]:
f3.city

0    北京
1    北京
2    北京
3    上海
4    上海
5    上海
Name: city, dtype: object

In [46]:
f3.city.to_frame()

  city
0   北京
1   北京
2   北京
3   上海
4   上海
5   上海

In [49]:
dataframe

  city  year  population
0   北京  2000         1.5
1   北京  2001         1.7
2   北京  2002         3.6
3   上海  2001         2.4
4   上海  2002         2.9
5   上海  2003         3.2

In [50]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

In [51]:
f4.loc[['one','three'],['year']]

       year
one    2000
three  2002

In [52]:
f4.loc[['one','three'],'year']

one      2000
three    2002
Name: year, dtype: int64

In [53]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

In [57]:
# 名字索引用 loc
f4.loc[['one','three'],['year','city']]

       year city
one    2000   北京
three  2002   北京

In [58]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

In [59]:
f4.iloc[0:2,[0,3]] # 数字索引用 iloc

    city    a
one   北京  NaN
two   北京  NaN

In [60]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

# 取列数据

In [65]:
# 第一种
f4['city']

one      北京
two      北京
three    北京
foru     上海
five     上海
six      上海
Name: city, dtype: object

In [66]:
# 第二种
f4.city

one      北京
two      北京
three    北京
foru     上海
five     上海
six      上海
Name: city, dtype: object

In [78]:
# 第三种
f4.loc[['one','two','three','foru','five','six'],'city']

one      北京
two      北京
three    北京
foru     上海
five     上海
six      上海
Name: city, dtype: object

In [98]:
# 第四种
f4.iloc[0:,0]

one      北京
two      北京
three    北京
foru     上海
five     上海
six      上海
Name: city, dtype: object

In [100]:
f4.iloc[0::2,0:]

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
three   北京  2002         3.6  NaN  NaN
five    上海  2002         2.9  NaN  NaN

In [85]:
f4.iloc[:,1::2]

       year    a
one    2000  NaN
two    2001  NaN
three  2002  NaN
foru   2001  NaN
five   2002  NaN
six    2003  NaN

In [92]:
# 奇数行,偶数列
f4.iloc[np.arange(f4.shape[0]) % 2==1,np.arange(f4.shape[1]) % 2 == 0]

     city  population    b
two    北京         1.7  NaN
foru   上海         2.4  NaN
six    上海         3.2  NaN

In [93]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

# 取行数据

In [94]:
f4.loc['one',:]

city            北京
year          2000
population     1.5
a              NaN
b              NaN
Name: one, dtype: object

In [101]:
f4.loc['one']

city            北京
year          2000
population     1.5
a              NaN
b              NaN
Name: one, dtype: object

In [95]:
f4.loc['one']

city            北京
year          2000
population     1.5
a              NaN
b              NaN
Name: one, dtype: object

In [96]:
f4.loc[['one','two']]

    city  year  population    a    b
one   北京  2000         1.5  NaN  NaN
two   北京  2001         1.7  NaN  NaN

In [97]:
f4.iloc[0:2]

    city  year  population    a    b
one   北京  2000         1.5  NaN  NaN
two   北京  2001         1.7  NaN  NaN

In [102]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

In [103]:
f4['a'] = np.arange(1,0.5*(f4.shape[0])+1,0.5)
f4

      city  year  population    a    b
one     北京  2000         1.5  1.0  NaN
two     北京  2001         1.7  1.5  NaN
three   北京  2002         3.6  2.0  NaN
foru    上海  2001         2.4  2.5  NaN
five    上海  2002         2.9  3.0  NaN
six     上海  2003         3.2  3.5  NaN

# 删除列

In [104]:
del f4['b']
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [105]:
f4['b'] = [1,2,3,2,1,4]
f4

      city  year  population    a  b
one     北京  2000         1.5  1.0  1
two     北京  2001         1.7  1.5  2
three   北京  2002         3.6  2.0  3
foru    上海  2001         2.4  2.5  2
five    上海  2002         2.9  3.0  1
six     上海  2003         3.2  3.5  4

In [106]:
# inplace True 是在源数据上修改, False 相反
f4.drop(['b'],axis = 1, inplace = True)
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [107]:
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [110]:
f4.drop(['a'],axis = 1)

      city  year  population
one     北京  2000         1.5
two     北京  2001         1.7
three   北京  2002         3.6
foru    上海  2001         2.4
five    上海  2002         2.9
six     上海  2003         3.2

In [111]:
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [112]:
f4.drop("a",axis = 1)

      city  year  population
one     北京  2000         1.5
two     北京  2001         1.7
three   北京  2002         3.6
foru    上海  2001         2.4
five    上海  2002         2.9
six     上海  2003         3.2

In [113]:
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

# 删除行

In [114]:
f4.drop(["one"],axis = 0)

      city  year  population    a
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [115]:
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [116]:
f4.drop(["one","three"],axis = 0)

     city  year  population    a
two    北京  2001         1.7  1.5
foru   上海  2001         2.4  2.5
five   上海  2002         2.9  3.0
six    上海  2003         3.2  3.5

In [117]:
f4

      city  year  population    a
one     北京  2000         1.5  1.0
two     北京  2001         1.7  1.5
three   北京  2002         3.6  2.0
foru    上海  2001         2.4  2.5
five    上海  2002         2.9  3.0
six     上海  2003         3.2  3.5

In [120]:
f4.drop(["one","three"],axis = 0,inplace = True)

In [121]:
f4

     city  year  population    a
two    北京  2001         1.7  1.5
foru   上海  2001         2.4  2.5
five   上海  2002         2.9  3.0
six    上海  2003         3.2  3.5

In [ ]:
f4['a'] = np.arange(1,0.5*(f4.shape[0])+1,0.5)

In [125]:
f4["b"] = np.arange(1,f4.shape[0] + 1)

In [126]:
f4

     city  year  population    a  b
two    北京  2001         1.7  1.5  1
foru   上海  2001         2.4  2.5  2
five   上海  2002         2.9  3.0  3
six    上海  2003         3.2  3.5  4

In [127]:
f4 = pd.DataFrame(data,columns=['city','year','population','a','b'],index = ['one','two','three','foru','five','six'])
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

In [130]:
f4.drop(labels = "b",axis = 1)

      city  year  population    a
one     北京  2000         1.5  NaN
two     北京  2001         1.7  NaN
three   北京  2002         3.6  NaN
foru    上海  2001         2.4  NaN
five    上海  2002         2.9  NaN
six     上海  2003         3.2  NaN

In [131]:
f4.drop(labels = ["b"],axis = 1)

      city  year  population    a
one     北京  2000         1.5  NaN
two     北京  2001         1.7  NaN
three   北京  2002         3.6  NaN
foru    上海  2001         2.4  NaN
five    上海  2002         2.9  NaN
six     上海  2003         3.2  NaN

In [132]:
f4

      city  year  population    a    b
one     北京  2000         1.5  NaN  NaN
two     北京  2001         1.7  NaN  NaN
three   北京  2002         3.6  NaN  NaN
foru    上海  2001         2.4  NaN  NaN
five    上海  2002         2.9  NaN  NaN
six     上海  2003         3.2  NaN  NaN

# apply

In [246]:
f4 = pd.DataFrame({"a":[1,2,3],
                   "b":[4,5,6]},
                    index = ["one","two","three"])
f4

       a  b
one    1  4
two    2  5
three  3  6

In [151]:
def function(a):
    return a ** 2

In [152]:
f4["a"].apply(function)

one      1
two      4
three    9
Name: a, dtype: int64

In [154]:
f4["a"].apply(lambda x: x ** 2)

one      1
two      4
three    9
Name: a, dtype: int64

In [226]:
def sum1(a,b):
    return a * b

In [198]:
f4

       a  b
one    1  4
two    2  5
three  3  6

### 测试

In [243]:
df = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8]],
                  index=list('AB'),
                  columns=list('abcd'))
df

   a  b  c  d
A  1  2  3  4
B  5  6  7  8

In [217]:
def test(x, y, z):
    return x + y + z

In [222]:
df.apply(test, args=(10,20))

    a   b   c   d
A  31  32  33  34
B  35  36  37  38

In [249]:
f4

       a  b
one    1  4
two    2  5
three  3  6

In [259]:
f4 = pd.DataFrame({"a":[1,2,3],
                   "b":[4,5,6]},
                    index = ["one","two","three"])
f4

       a  b
one    1  4
two    2  5
three  3  6

In [253]:
f4.drop(['three'],axis = 0,inplace = True)

In [260]:
f4

       a  b
one    1  4
two    2  5
three  3  6

def  sum_test (a, b)：

　　return a+b

如果想对df表中其中两列(列名1，列名2)作加和处理操作，得到新列名位sum_value：

两种不同的写法：

1、df ['sum_value'] = df.apply(lambda x: sum_test(x['列名1']，x['列名2'])， axis=1)

2、df ['sum_value'] = df.apply(sum_test，args= ( sum_test(df['列名1']，df['列名2'] )， axis=1)

 axis=1代表，对纵轴数据进行相关操作，即列。

# df.apply(sum1,args=(("a","b")),axis = 1)

In [162]:
f4["a"] + f4["b"]

one      5
two      7
three    9
dtype: int64

In [183]:
f6 = pd.DataFrame({'b':[1,0,0,1],
                   'a':[1,5,6,7]
                  },
                   index = ["o","t","w","f"])

In [184]:
f6

   b  a
o  1  1
t  0  5
w  0  6
f  1  7

In [185]:
f6.sort_index() # 索引默认字母升序

   b  a
f  1  7
o  1  1
t  0  5
w  0  6

In [186]:
f6.sort_index(axis = 0)

   b  a
f  1  7
o  1  1
t  0  5
w  0  6

In [187]:
f6

   b  a
o  1  1
t  0  5
w  0  6
f  1  7

In [188]:
f6.sort_index(axis = 1) # 列名升序

   a  b
o  1  1
t  5  0
w  6  0
f  7  1

In [189]:
# ascending True 升序,False 降序
f6.sort_index(axis = 1,ascending = False)

   b  a
o  1  1
t  0  5
w  0  6
f  1  7

In [192]:
# a列的数据 升序
f6.sort_values(by = "a")

   b  a
o  1  1
t  0  5
w  0  6
f  1  7

In [193]:
f6.sort_values(by = "b")

   b  a
t  0  5
w  0  6
o  1  1
f  1  7

In [196]:
# 先按b 升序,相同再按a升序
f6.sort_values(by = ["b","a"])

   b  a
t  0  5
w  0  6
o  1  1
f  1  7

In [197]:
f6.sort_values(by = ["b","a"],ascending = False)

   b  a
f  1  7
o  1  1
w  0  6
t  0  5